#include"Library.h"

class Menu {
public:
	void Vmenu() {
		cout << " #======================MENU=====================#" << endl;
		cout << "  |                                             | " << endl;
		cout << "  |  1 -- п≥драхунок площ≥ геометричних ф≥гур.  | " << endl;
		cout << "  |                                             | " << endl;
		cout << "  |  2 -- механ≥зм делегуванн€                  | " << endl;
		cout << "  |    конструктор≥в  ≥ можлив≥сть  отриманн€   | " << endl;
		cout << "  |    к≥лькост≥ створених екземпл€р≥в.         | " << endl;
		cout << "  |                                             | " << endl;
		cout << "  |  3 -- розроблений клас String.              | " << endl;
		cout << "  |                                             | " << endl;
		cout << " #===============================================#" << endl;
	}
};